src/integ-test/bdd-test/resources/xml/sendPaymentOutcomeV2Body_MBD_For_TestProd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:sendPaymentOutcomeV2Request>
            <idPSP>$idPSP</idPSP>
            <idBrokerPSP>$idBrokerPSP</idBrokerPSP>
            <idChannel>$idChannel</idChannel>
            <password>$password</password>
            <idempotencyKey>$idempotencyKey</idempotencyKey>
            <paymentTokens>
                <paymentToken>$paymentToken</paymentToken>
            </paymentTokens>
            <outcome>$outcome</outcome>
            <details>
                <paymentMethod>$paymentMethod</paymentMethod>
                <paymentChannel>app</paymentChannel>
                <fee>$fee</fee>
				<applicationDate>2024-07-10</applicationDate>
				<transferDate>2024-07-11</transferDate>
                <marcheDaBollo>
                    <marcaDaBollo>
                        <paymentToken>$paymentToken</paymentToken>
                        <idTransfer>$idTransfer</idTransfer>
                        <MBDAttachment>$MBDAttachment</MBDAttachment>
                    </marcaDaBollo>
                </marcheDaBollo>
            </details>
        </nod:sendPaymentOutcomeV2Request>
    </soapenv:Body>
</soapenv:Envelope>